Джира/src/InformationRegisters/Центр_СтатусыЗадач/Центр_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_СтатусыЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Центр_СтатусыЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Enums/Центр_ПодпискаДляТриггера/Центр_ПодпискаДляТриггера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Центр_ПодпискаДляТриггера</name>
  <enumValues>
    <name>ПроведениеДокументаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервереФормыЗадачи</name>
  </enumValues>
  <enumValues>
    <name>КнопкаЗакрытияЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаВопросПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВопросаПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
</mdclass:Enum>

Джира/src/CommonModules/Центр_ОбработкаТриггеров/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ВызовТриггера(Подписка, Задача = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_Триггеры.Запрос,
		|	Центр_Триггеры.Ссылка,
		|	Центр_Триггеры.Уведомлять,
		|	Центр_Триггеры.Статус,
		|	Центр_Триггеры.Наименование
		|ПОМЕСТИТЬ вт_Триггер
		|ИЗ
		|	Справочник.Центр_Триггеры КАК Центр_Триггеры
		|ГДЕ
		|	Центр_Триггеры.Подписка = &Подписка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Триггер.Запрос КАК Запрос,
		|	вт_Триггер.Ссылка КАК Ссылка,
		|	вт_Триггер.Уведомлять КАК Уведомлять,
		|	вт_Триггер.Статус КАК Статус,
		|	Центр_ТриггерыПараметры.Параметр,
		|	Центр_ТриггерыПараметры.Значение,
		|	вт_Триггер.Наименование КАК Наименование
		|ИЗ
		|	вт_Триггер КАК вт_Триггер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Центр_Триггеры.Параметры КАК Центр_ТриггерыПараметры
		|		ПО вт_Триггер.Ссылка = Центр_ТриггерыПараметры.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Запрос) КАК Запрос,
		|	МАКСИМУМ(Уведомлять) КАК Уведомлять,
		|	МАКСИМУМ(Наименование) КАК Наименование,
		|	МАКСИМУМ(Статус) КАК Статус
		|ПО
		|	Ссылка";
	Запрос.УстановитьПараметр("Подписка", Подписка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Попытка
			 ВыполнениеЗапросаИзСправочника(Выборка, Задача);		
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка Выполнения");
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнениеЗапросаИзСправочника(СправочникКонтроля, Задача)
	Запрос = Новый Запрос;
	Запрос.Текст = СправочникКонтроля.Запрос;
	ВыборкаПараметровКонтроля = СправочникКонтроля.Выбрать();
	Пока ВыборкаПараметровКонтроля.Следующий() Цикл
		Запрос.УстановитьПараметр(ВыборкаПараметровКонтроля.Параметр, ВыборкаПараметровКонтроля.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Задача", Задача);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ТекущаяДата = ТекущаяДатаСеанса();
		Если Выборка.Владелец().Колонки.Найти("Ссылка") <> Неопределено Тогда
			РегистрыСведений.Центр_СтатусыЗадач.ЗаписатьСтатусЗадачи(Выборка.Ссылка, СправочникКонтроля.Статус,
				ТекущаяДата);

			Если СправочникКонтроля.Уведомлять И Выборка.Владелец().Колонки.Найти("Пользователь") <> Неопределено Тогда
				Если ЗначениеЗаполнено(Выборка.Пользователь) Тогда
					ТекстНапоминания = Строка(Выборка.Пользователь) + " " + Строка(СправочникКонтроля.Наименование);
					Центр_УведомленияПользователей.ОтправитьУведомлениеПользователю(Выборка.Пользователь,
						ТекстНапоминания, ТекущаяДата, ТекущаяДата,
						Перечисления.СпособыУстановкиВремениНапоминания.Периодически, 60, Выборка.Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Центр_ВызовТриггера() Экспорт
	ВызовТриггера(Перечисления.Центр_ПодпискаДляТриггера.РегламентноеЗадание);
КонецПроцедуры
#КонецОбласти
